{
    "en": {
        "pageTitle": "Projects Portfolio",
        "language": "EN",
        "aboutMe": "About me",
        "name": "Camilo Alejandro Lagos Malaver",
        "student": "Student | Junior Game Developer",
        "university": "National University of Colombia",
        "degree": "Computer & Systems Engineering",
        "personalDescription": "My name is Camilo. I have experience programming video game mechanics and systems, as well as developing full-stack web applications. I am proficient in using various design patterns, such as the singleton pattern and object-oriented programming.",
        "technologies": "Technologies",
        "projects": "Projects",
        "repo": "Repo",
        "spaceshooterpro": "Space Shooter Pro",
        "spaceshooterproDesc": "In this exciting game, eliminate your alien rivals while moving through space and avoiding dangers. Made with Unity and C#.",
        "thegreatfleece": "The Great Fleece",
        "thegreatfleeceDesc": "Darren, can you go unnoticed and reach the vault? A stealth game where you must avoid security cameras and guards. Made with Unity and C#.",
        "promediosunal": "Promedios Universidad Nacional",
        "promediosunalDesc": "A website designed to help students calculate their grades, built with only JavaScript, CSS, and HTML.",
        "marsmarine": "Mars Marine",
        "marsmarineDesc": "The red planet is unforgiving, and the alien threat never stops. How long can you survive?. Made with Unreal Engine.",
        "dungeonescape": "Dungeon Escape",
        "dungeonescapeDesc": "Can you defeat the monsters, collect the diamonds, and escape before it's too late? The dungeon awaits!. Made with Unity and C#.",
        "clock": "Clock",
        "clockDesc": "A clock and temperature and humidity sensor that sends the data to ThingSpeak and can be controlled through buttons or a web terminal. Made with C++.",
        "moodpress": "MoodPress",
        "moodpressDesc": "A wellness application for daily mood tracking that identifies patterns and provides personalized mental health tips. Made as a team project with C#.",
        "schedulegenerator": "Schedule Generator",
        "schedulegeneratorDesc": "This is a single-page web application designed to help university students generate personalized schedules based on their courses, groups, and priorities. Everything runs in the browser, no installation or accounts required.",
        "ecommerce": "Ecommerce",
        "ecommerceDesc": "A complete e-commerce web application built with JavaScript. Features include product catalog, shopping cart, and user management. Available as a web app and mobile application on Google Play.",
        "healthScope": "Health Scope",
        "healthScopeDesc": "A comprehensive health and wellness application that leverages Gemini AI to provide personalized health insights. It features AI-driven analysis that provides an overall health score, general recommendations, and alopecia risk assessment."
    },
    "es": {
        "pageTitle": "Portafolio de Proyectos",
        "language": "ES",
        "aboutMe": "Sobre mí",
        "name": "Camilo Alejandro Lagos Malaver",
        "student": "Estudiante | Junior Game Developer",
        "university": "Universidad Nacional de Colombia",
        "degree": "Ingeniería de Sistemas y Computación",
        "personalDescription": "Mi nombre es Camilo. Tengo experiencia en la programación de mecánicas y sistemas de videojuegos, así como en el desarrollo de aplicaciones web full-stack. Soy competente en el uso de varios patrones de diseño, como el patrón singleton y la programación orientada a objetos.",
        "technologies": "Tecnologías",
        "projects": "Proyectos",
        "repo": "Repositorio",
        "spaceshooterpro": "Space Shooter Pro",
        "spaceshooterproDesc": "En este emocionante juego, elimina a tus rivales alienígenas mientras te mueves por el espacio y evitas peligros. Hecho con Unity y C#.",
        "thegreatfleece": "The Great Fleece",
        "thegreatfleeceDesc": "Darren, ¿puedes pasar desapercibido y llegar a la bóveda? Un juego de sigilo en el que debes evitar las cámaras de seguridad y los guardias. Hecho con Unity y C#.",
        "promediosunal": "Promedios Universidad Nacional",
        "promediosunalDesc": "Un sitio web diseñado para ayudar a los estudiantes a calcular sus calificaciones, construido solo con JavaScript, CSS y HTML.",
        "marsmarine": "Mars Marine",
        "marsmarineDesc": "El planeta rojo no perdona, y la amenaza alienígena nunca se detiene. ¿Cuánto tiempo puedes sobrevivir?. Hecho con Unreal Engine.",
        "dungeonescape": "Dungeon Escape",
        "dungeonescapeDesc": "¿Puedes derrotar a los monstruos, recoger los diamantes y escapar antes de que sea demasiado tarde? ¡La mazmorras te esperan!. Hecho con Unity y C#.",
        "clock": "Reloj",
        "clockDesc": "Un reloj y sensor de temperatura y humedad que envía los datos a ThingSpeak y se puede controlar a través de botones o un terminal web. Hecho con C++.",
        "moodpress": "MoodPress",
        "moodpressDesc": "Una aplicación de bienestar para el seguimiento diario del estado de ánimo que identifica patrones y ofrece consejos personalizados de salud mental. Hecho en equipo de trabajo con C#.",
        "schedulegenerator": "Generador de Horarios",
        "schedulegeneratorDesc": "Esta es una aplicación web de una sola página diseñada para ayudar a estudiantes universitarios a generar horarios personalizados según sus materias, grupos y prioridades. Todo se gestiona en el navegador, sin necesidad de instalar nada ni crear cuentas.",
        "ecommerce": "Ecommerce",
        "ecommerceDesc": "Una aplicación web de comercio electrónico completa construida con JavaScript. Incluye catálogo de productos, carrito de compras y gestión de usuarios. Disponible como aplicación web y aplicación móvil en Google Play.",
        "healthScope": "Health Scope",
        "healthScopeDesc": "Una aplicación integral de salud y bienestar que aprovecha la IA de Gemini para ofrecer información personalizada. Incluye un análisis de IA que determina el puntaje general de salud, recomendaciones generales y riesgo de alopecia."
    }
}
